app/controllers/works_controller.rb

INSERT INTO "works" ("body", "created_at", "index", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "stysrysaeryaery"], ["created_at", "2014-10-13 13:35:20.884588"], ["index", 1], ["name", "Landstone"], ["updated_at", "2014-10-13 13:35:20.884588"]]
---
  def create
    @work = Work.new(work_params)

    respond_to do |format|
      if @work.save

SELECT  "works".* FROM "works"  WHERE "works"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_work
      @work = Work.find(params[:id])